Python can be used as calculator.

In [1]:
2+2

4

Do the lesson in co lab. Similar to jupyter notebook. https://hub.ovh2.mybinder.org/user/ccss-rs-python-bootcamp-ui8a8d4m/lab/tree/tutorial_jan23.ipynb

In [2]:
print(2+2)
#Now store into variable name.
#Show a comment. object on left created as expression on right
var1 = 2+2

4

Formatting when printing

In [3]:
age_1= 34
Response_ID = 1
print('Participant', Response_ID, 'is', age_1, 'years old.')

Participant 1 is 34 years old.

In [4]:
#Create a string variable. Object that contains text. 
hometown = 'ithaca'

Print type of object. String, int, float.

In [6]:
type(age_1)

int

In [7]:
type(hometown)

str

Calculations of objects. This is the foundation. Creativity can generate whatever you want.

In [8]:
Later_Age = age_1 + 3
print(Later_Age)

37

Notice how object name gets overwritten. Most recent code runs.

In [9]:
Later_Age = age_1 * 3
print(Later_Age)

102

 divide. ** exponent.

User created function. Variable names in function get replaced. Does a task that you define. Notice the indent and explain. <br>
Variables in function are like temporary names. Get replaced with real names.

In [10]:
def increase_age(starting_age):
    later_age = starting_age + 3
    print("The age after 3 years will be", later_age)

In [11]:
increase_age(age_1)

The age after 3 years will be 37

Exercise. Convert Celsius to farenheit. Accept a number in celsius and print out farenheit

In [12]:
#Type answer here.

32.0

Python has plenty of pre created functions. This is where you use your resources. Research online how to perform specific operations. Pre-defined functions.

In [ ]:
round(5.389, 1)
help(round)

Lists.

In [ ]:
list = [1, 2, 3, 4, 5, 6]

More on pre-created functions this time applied to lists.

In [ ]:
min(list)
sum(list)
len(list)

Index list. Print specific elements of list.

In [ ]:
print('First element is index 0', list[0])
print('4th element is index 3', list[0])

Reverse direction

In [ ]:
print('5th element is index -1', list[-1])

Slice list. [starting:ending]

In [ ]:
rem = list[:4]
print(rem)

Append list item. Add to end of list.

In [ ]:
list.append(7)
print(list)

Loop and conditionals?<br>
Create looping item. Loop through all items of list.

In [ ]:
for item in list:
    if item < 3:
        print(item)
    elif item > 3:
        print("Greater than 3")
    else:
        print("The rest")

Exercise. combination of things done so far.<br>
1. Create a new list of cities in America. ex Boston. New York. Chicago. Miami.<br>
2. Print 2nd to last element of above created list.<br>
3. Add international city 'Prague' to list<br>
4. Bonus: Loop through the items in this list and print the cities that contain the letter 'i'<br>
Hint. string.find function. Research online how to use.<br>
Helpful link. http://net-informations.com/python/basics/contains.htm

Pandas. Groupby, basic stats, sorting, conditional subsetting. Missing values.

In [1]:
from pandas import DataFrame, read_csv
import pandas as pd
Location = './data/survey_responses.csv'
df = pd.read_csv(Location)
type(df)
age_column = df['Age']
display(age_column)
multi_columns = df[['Age', 'Living_Location']]
display(multi_columns)
multi_rows = df.loc[[1,2,3,4]]
display(multi_rows)

0      20.0
1      20.0
2      21.0
3      19.0
4      21.0
       ...
894    19.0
895    20.0
896    19.0
897     NaN
898     NaN
Name: Age, Length: 899, dtype: float64

      Age Living_Location
0    20.0      Off campus
1    20.0      Off campus
2    21.0      Off campus
3    19.0       On campus
4    21.0      Off campus
..    ...             ...
894  19.0       On campus
895  20.0       On campus
896  19.0       On campus
897   NaN             NaN
898   NaN             NaN

[899 rows x 2 columns]

,Time_Stamp,Year,Month,Response_ID,Hunger_Experience,Moving_Times,Self_Confidence,Hometown,Age,Parental_Income,Race_Ethnicity,School_Year,Transfer_Student,College,Gender_Identity,Sex,Living_Location,Unnamed: 17
1,4/15/2021 11:30,2021,April,2,No,1,Agree slightly,"Brooklyn, New York 11225",20.0,"Below $40,000",Black,3rd year undergraduate,No,College of Human Ecology,Woman,Female,Off campus,NaN
2,4/15/2021 13:00,2021,April,3,No,5,Agree somewhat,"Roslyn Heights, New York 11577",21.0,"More than $750,000",Asian,3rd year undergraduate,No,College of Agriculture and Life Sciences,Woman,Female,Off campus,NaN
3,4/15/2021 14:01,2021,April,4,No,1,Agree slightly,"Rye Brook, New York 10573",19.0,"More than $750,000",White (of European descent),2nd year undergraduate,No,College of Human Ecology,Woman,Female,On campus,NaN
4,4/15/2021 14:31,2021,April,5,No,0,Agree somewhat,"San Antonio, Texas 78218",21.0,"$100,000 - $174,999","White (of European descent),Hispanic",4th year undergraduate,No,College of Arts and Sciences,Woman,Female,Off campus,NaN

In [2]:
print(df["Age"].min()) # what's the age of the youngest participant?
print(df["Age"].max()) # what's the age of the oldest participant?
print(df["Age"].mean()) # what's the average age of participants?

16.0
36.0
19.84585492227979

In [3]:
df[df["Age"] <= 30]

,Time_Stamp,Year,Month,Response_ID,Hunger_Experience,Moving_Times,Self_Confidence,Hometown,Age,Parental_Income,Race_Ethnicity,School_Year,Transfer_Student,College,Gender_Identity,Sex,Living_Location,Unnamed: 17
0,4/14/2021 19:43,2021,April,1,No,1,Agree slightly,"Coconut Grove, Florida 33133",20.0,"More than $750,000",White (of European descent),2nd year undergraduate,No,College of Human Ecology,Woman,Female,Off campus,NaN
1,4/15/2021 11:30,2021,April,2,No,1,Agree slightly,"Brooklyn, New York 11225",20.0,"Below $40,000",Black,3rd year undergraduate,No,College of Human Ecology,Woman,Female,Off campus,NaN
2,4/15/2021 13:00,2021,April,3,No,5,Agree somewhat,"Roslyn Heights, New York 11577",21.0,"More than $750,000",Asian,3rd year undergraduate,No,College of Agriculture and Life Sciences,Woman,Female,Off campus,NaN
3,4/15/2021 14:01,2021,April,4,No,1,Agree slightly,"Rye Brook, New York 10573",19.0,"More than $750,000",White (of European descent),2nd year undergraduate,No,College of Human Ecology,Woman,Female,On campus,NaN
4,4/15/2021 14:31,2021,April,5,No,0,Agree somewhat,"San Antonio, Texas 78218",21.0,"$100,000 - $174,999","White (of European descent),Hispanic",4th year undergraduate,No,College of Arts and Sciences,Woman,Female,Off campus,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
889,5/16/2022 22:07,2022,May,890,No,5,Agree somewhat,"Albany, New York, 12202",18.0,"$60,000 - $99,999",Black,1st year undergraduate,No,College of Arts and Sciences,Man,Male,On campus,NaN
893,5/18/2022 20:59,2022,May,894,NaN,NaN,NaN,nyc 10010,22.0,"$40,000 - $59,999",Asian,4th year undergraduate,No,College of Engineering,Woman,Female,Off campus,NaN
894,5/19/2022 17:17,2022,May,895,No,2,Agree somewhat,"Boca Raton, Florida 33496",19.0,"$175,000 - $299,999","White (of European descent),Hispanic,Middle Ea...",1st year undergraduate,No,College of Arts and Sciences,Woman,Female,On campus,NaN
895,5/19/2022 19:26,2022,May,896,Yes,4,Agree somewhat,"Harrison, New York, 10528",20.0,"$175,000 - $299,999",Hispanic,2nd year undergraduate,Yes,College of Human Ecology,Woman,Female,On campus,NaN
896,5/20/2022 7:13,2022,May,897,No,1,Agree slightly,"Guangzhou, Guangdong, China 510335",19.0,"$300,000 - $499,999",Asian,1st year undergraduate,No,College of Human Ecology,Woman,Female,On campus,NaN

In [4]:
df_grouped = df.groupby("College")
display(df_grouped["College"].count())

College
College of Agriculture and Life Sciences     123
College of Architecture, Art and Planning      5
College of Arts and Sciences                 264
College of Engineering                       103
College of Human Ecology                     208
SC Johnson College of Business                36
School of Industrial and Labor Relations      25
Weill Cornell Medicine                         8
Name: College, dtype: int64

Drop missing values

In [ ]:
data.dropna()